let arrayProductInfo = [
    {
        id: 1,
        name: 'لپ تاپ  1 ',
        price: 10,
        srcImg: 'productImg/kala1.jpg',
        details: 'Ram 16 Cpu i7  Gpu 2G',
        grouping: 'LapTop',
        existence: yes,
        discount: '5%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    {
        id: 2,
        name: 'لپ تاپ  2 ',
        price: 15,
        srcImg: 'productImg/kala2.jfif',
        details: 'Ram 8 Cpu i5  Gpu 2G',
        grouping: 'LapTop',
        existence: yes,
        discount: '5%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    {
        id: 3,
        name: 'لپ تاپ  3 ',
        price: 20,
        srcImg: 'productImg/kala3.jfif',
        details: 'Ram 4 Cpu i3  Gpu 2G',
        grouping: 'LapTop',
        existence: no,
        discount: '0%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    {
        id: 4,
        name: 'لپ تاپ  4 ',
        price: 25,
        srcImg: 'productImg/kala1.jpg',
        details: 'Ram 2 Cpu i2  Gpu 2G ',
        grouping: 'LapTop',
        existence: yes,
        discount: '5%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    {
        id: 5,
        name: 'لپ تاپ  5 ',
        price: 30,
        srcImg: 'productImg/kala2.jfif',
        details: 'Ram 4 Cpu i5  Gpu 2G',
        grouping: 'LapTop',
        existence: no,
        discount: '0%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    {
        id: 6,
        name: 'لپ تاپ  6 ',
        price: 40,
        srcImg: 'productImg/kala3.jfif',
        details: 'Ram 16 Cpu i9  Gpu 2G',
        grouping: 'LapTop',
        existence: yes,
        discount: '5%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    {
        id: 7,
        name: 'لپ تاپ  7 ',
        price: 45,
        srcImg: 'productImg/kala1.jpg',
        details: 'Ram 8 Cpu i11  Gpu 2G ',
        grouping: 'LapTop',
        existence: yes,
        discount: '5%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    {
        id: 8,
        name: 'لپ تاپ  8 ',
        price: 50,
        srcImg: 'productImg/kala2.jfif',
        details: 'Ram 4 Cpu i7  Gpu 2G',
        grouping: 'LapTop',
        existence: no,
        discount: '0%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    // {id :9   ,  name : 'لپ تاپ  9 '  , price : 55 , srcImg :  'productImg/kala3.jfif'  , details :    'Ram 4 Cpu i5  Gpu 2G' , grouping : 'LapTop'   ,existence : true ,  discount : '5%' },
    // {id :10   ,  name :'لپ تاپ  10 '  , price :  60, srcImg :  'productImg/kala3.jfif'   ,  details :    'Ram 4 Cpu i5  Gpu 2G' ,grouping : 'LapTop'   ,existence :true  ,  discount : '5%' },
    {
        id: 11,
        name: 'یخچال 1',
        price: 70,
        srcImg: 'productImg/kala4.jfif',
        details: 'محصول خوب و قوی ',
        grouping: 'refrigerator',
        existence: true,
        discount: '5%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    {
        id: 12,
        name: 'یخچال 2',
        price: 75,
        srcImg: 'productImg/kala5.jfif',
        details: 'محصول خوب و قوی ',
        grouping: 'refrigerator',
        existence: true,
        discount: '5%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    {
        id: 13,
        name: 'یخچال 3',
        price: 85,
        srcImg: 'productImg/kala6.jfif',
        details: 'محصول خوب و قوی ',
        grouping: 'refrigerator',
        existence: true,
        discount: '5%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    {
        id: 14,
        name: 'یخچال 4',
        price: 90,
        srcImg: 'productImg/kala4.jfif',
        details: 'محصول خوب و قوی ',
        grouping: 'refrigerator',
        existence: true,
        discount: '5%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    {
        id: 15,
        name: 'یخچال 5',
        price: 95,
        srcImg: 'productImg/kala5.jfif',
        details: 'محصول خوب و قوی ',
        grouping: 'refrigerator',
        existence: true,
        discount: '5%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    {
        id: 16,
        name: 'یخچال 6',
        price: 100,
        srcImg: 'productImg/kala6.jfif',
        details: 'محصول خوب و قوی ',
        grouping: 'refrigerator',
        existence: true,
        discount: '5%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    {
        id: 17,
        name: 'یخچال 7',
        price: 110,
        srcImg: 'productImg/kala4.jfif',
        details: 'محصول خوب و قوی ',
        grouping: 'refrigerator',
        existence: true,
        discount: '5%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    {
        id: 18,
        name: 'یخچال 8',
        price: 115,
        srcImg: 'productImg/kala5.jfif',
        details: 'محصول خوب و قوی ',
        grouping: 'refrigerator',
        existence: true,
        discount: '5%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    // {id :19   ,  name :'یخچال 9'   , price :  120, srcImg :   'productImg/kala6.jfif'  , details :    'محصول خوب و قوی ' , grouping :  'refrigerator'  ,existence :true  ,  discount : '5%' },
    // {id :20   ,  name :'یخچال 10'   , price :  125, srcImg :  'productImg/kala6.jfif'  , details :    'محصول خوب و قوی ' , grouping : 'refrigerator'   ,existence :true  ,  discount : '5%' },
    {
        id: 21,
        name: 'جارو برقی 1',
        price: 15,
        srcImg: 'productImg/kala7.jfif',
        details: 'محصول خوب و قوی ',
        grouping: 'cleaner',
        existence: true,
        discount: '5%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    {
        id: 22,
        name: 'جارو برقی 2',
        price: 15,
        srcImg: 'productImg/kala8.jfif',
        details: 'محصول خوب و قوی ',
        grouping: 'cleaner',
        existence: true,
        discount: '5%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    {
        id: 23,
        name: 'جارو برقی 3',
        price: 15,
        srcImg: 'productImg/kala9.jfif',
        details: 'محصول خوب و قوی ',
        grouping: 'cleaner',
        existence: true,
        discount: '5%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    {
        id: 24,
        name: 'جارو برقی 4',
        price: 15,
        srcImg: 'productImg/kala7.jfif',
        details: 'محصول خوب و قوی ',
        grouping: 'cleaner',
        existence: true,
        discount: '5%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    {
        id: 25,
        name: 'جارو برقی 5',
        price: 15,
        srcImg: 'productImg/kala8.jfif',
        details: 'محصول خوب و قوی ',
        grouping: 'cleaner',
        existence: true,
        discount: '5%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    {
        id: 26,
        name: 'جارو برقی 6',
        price: 15,
        srcImg: 'productImg/kala9.jfif',
        details: 'محصول خوب و قوی ',
        grouping: 'cleaner',
        existence: true,
        discount: '5%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    {
        id: 27,
        name: 'جارو برقی 7',
        price: 15,
        srcImg: 'productImg/kala7.jfif',
        details: 'محصول خوب و قوی ',
        grouping: 'cleaner',
        existence: true,
        discount: '5%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    {
        id: 28,
        name: 'جارو برقی 8',
        price: 15,
        srcImg: 'productImg/kala8.jfif',
        details: 'محصول خوب و قوی ',
        grouping: 'cleaner',
        existence: true,
        discount: '5%',
        tagP: 'ورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،' +
            ' چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، ' +
            'و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،' +
            ' شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد،',
        nameBrand: 'Dell',
        lengthWidth: '2 * 3 متر',
        possibilities: 'محصول خوب و قوی',
    },
    // {id :29   ,  name :  'جارو برقی 9' , price : 15 , srcImg : 'productImg/kala9.jfif'   , details :    'محصول خوب و قوی ' , grouping : 'cleaner'   ,existence :true  ,  discount : '5%' },
    // {id :30   ,  name :  'جارو برقی 10' , price :15  , srcImg : 'productImg/kala9.jfif'   , details :    'محصول خوب و قوی ' , grouping :'cleaner'    ,existence : true ,  discount : '5%' },
]
let containerInfoProduct = document.querySelector('#productInfo')
let idProduct = new URLSearchParams(location.search).get('id')
console.log(Number(idProduct))
let productSelected = arrayProductInfo.find(function (product) {
    return product.id === Number(idProduct)
})
if (productSelected) {
    containerInfoProduct.insertAdjacentHTML('beforeend', '        <div class="img"><img src="' + productSelected.srcImg + '" alt="">\n' +
        '            <button class="btn-addCart"  onclick="addCartHandler()" >افزودن به سبد خرید</button>\n' +
        '            <h2>' + productSelected.price + 'میلیون</h2>\n' +
        '        </div>\n' +
        '        <div class="info">\n' +
        '            <div class="title"><h1>' + productSelected.name + '</h1></div>\n' +
        '            <div class="details">\n' +
        '                <p>' + productSelected.tagP + '</p>\n' +
        '            </div>\n' +
        '            <i class="' + productSelected.existence + '"></i>\n' +
        '            <span>' + productSelected.discount + '</span>\n' +
        '            <div class="infoProduct">\n' +
        '                <div class="infoProduct-title">\n' +
        '                    <div><h3>نام برند : </h3><h4>' + productSelected.nameBrand + '</h4></div>\n' +
        '                    <div><h3>ابعاد :</h3><h4>' + productSelected.lengthWidth + '</h4></div>\n' +
        '                    <div><h3>مشخصات :</h3><h4>' + productSelected.details + '</h4></div>\n' +
        '                    <div><h3>امکانات ویژه :</h3><h4>' + productSelected.possibilities + '</h4></div>\n' +
        '                </div>\n' +
        '                <div class="comment">\n' +
        '                    <input type="text" placeholder="تجربه خود را به اشتراک بذارید...">\n' +
        '                    <button class="saveComment">ثبت نظر</button>\n' +
        '                </div>\n' +
        '            </div>\n' +
        '\n' +
        '        </div>')
} else {
    containerInfoProduct.insertAdjacentHTML('beforeend', '<a href="../index.html"><h1 id="">محصول مورد نظر یافت نشد..! برای بازگشت کلیک کنید</h1></a>')
}